# Book Recommendations Dataset

This notebook uses the [Book Recommendations](https://www.kaggle.com/arashnic/book-recommendation-dataset) dataset available on Kaggle.

## Imports

In [143]:
# TODO: Import any other modules you need
import pandas as pd
import numpy as np
import statistics 
from datetime import datetime
import matplotlib.pyplot as plt

In [94]:
# TODO: Read Books.csv, Ratings.csv and Users.csv into similary named dataframes
books = pd.read_csv('C:\\Users\\martha\\Downloads\\archive\\Books.csv')
books.head()

c:\Users\martha\Documents\cohort7\cohort7_practicals\2_Webscraping_and_Data_Labelling\webscraping_env\lib\site-packages\IPython\core\interactiveshell.py:3444: DtypeWarning: Columns (3) have mixed types.Specify dtype option on import or set low_memory=False.
  exec(code_obj, self.user_global_ns, self.user_ns)

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
0,0195153448,Classical Mythology,Mark P. O. Morford,2002,Oxford University Press,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...,http://images.amazon.com/images/P/0195153448.0...
1,0002005018,Clara Callan,Richard Bruce Wright,2001,HarperFlamingo Canada,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...,http://images.amazon.com/images/P/0002005018.0...
2,0060973129,Decision in Normandy,Carlo D'Este,1991,HarperPerennial,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...,http://images.amazon.com/images/P/0060973129.0...
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999,Farrar Straus Giroux,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...,http://images.amazon.com/images/P/0374157065.0...
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999,W. W. Norton &amp; Company,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...,http://images.amazon.com/images/P/0393045218.0...

In [95]:
ratings = pd.read_csv('C:\\Users\\martha\\Downloads\\archive\\Ratings.csv')
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [96]:
users = pd.read_csv('C:\\Users\\martha\\Downloads\\archive\\Users.csv')
users.head()

   User-ID                            Location   Age
0        1                  nyc, new york, usa   NaN
1        2           stockton, california, usa  18.0
2        3     moscow, yukon territory, russia   NaN
3        4           porto, v.n.gaia, portugal  17.0
4        5  farnborough, hants, united kingdom   NaN

## Exploratory Data Analysis (EDA)

### TODO: 
* Use the `describe` and `info` methods on each of your dataframes. 
* Check the `dtypes` for the columns in each dataframe.
* Check for missing values in each dataframe
* Check for any other operations commonly used during EDA and perform it here

In [97]:
books.describe()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher,Image-URL-S,Image-URL-M,Image-URL-L
count,271360,271360,271359,271360,271358,271360,271360,271357
unique,271360,242135,102023,202,16807,271044,271044,271041
top,0195153448,Selected Poems,Agatha Christie,2002,Harlequin,http://images.amazon.com/images/P/185326119X.0...,http://images.amazon.com/images/P/185326119X.0...,http://images.amazon.com/images/P/225307649X.0...
freq,1,27,632,13903,7535,2,2,2

In [98]:
books.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271360 entries, 0 to 271359
Data columns (total 8 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ISBN                 271360 non-null  object
 1   Book-Title           271360 non-null  object
 2   Book-Author          271359 non-null  object
 3   Year-Of-Publication  271360 non-null  object
 4   Publisher            271358 non-null  object
 5   Image-URL-S          271360 non-null  object
 6   Image-URL-M          271360 non-null  object
 7   Image-URL-L          271357 non-null  object
dtypes: object(8)
memory usage: 16.6+ MB

In [99]:
ratings.describe()

            User-ID   Book-Rating
count  1.149780e+06  1.149780e+06
mean   1.403864e+05  2.866950e+00
std    8.056228e+04  3.854184e+00
min    2.000000e+00  0.000000e+00
25%    7.034500e+04  0.000000e+00
50%    1.410100e+05  0.000000e+00
75%    2.110280e+05  7.000000e+00
max    2.788540e+05  1.000000e+01

In [100]:
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1149780 entries, 0 to 1149779
Data columns (total 3 columns):
 #   Column       Non-Null Count    Dtype
---  ------       --------------    -----
 0   User-ID      1149780 non-null  int64
 1   ISBN         1149780 non-null  object
 2   Book-Rating  1149780 non-null  int64
dtypes: int64(2), object(1)
memory usage: 26.3+ MB

In [101]:
users.describe()

            User-ID            Age
count  278858.00000  168096.000000
mean   139429.50000      34.751434
std     80499.51502      14.428097
min         1.00000       0.000000
25%     69715.25000      24.000000
50%    139429.50000      32.000000
75%    209143.75000      44.000000
max    278858.00000     244.000000

In [102]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 278858 entries, 0 to 278857
Data columns (total 3 columns):
 #   Column    Non-Null Count   Dtype
---  ------    --------------   -----
 0   User-ID   278858 non-null  int64
 1   Location  278858 non-null  object
 2   Age       168096 non-null  float64
dtypes: float64(1), int64(1), object(1)
memory usage: 6.4+ MB

In [103]:
books.dtypes

ISBN                   object
Book-Title             object
Book-Author            object
Year-Of-Publication    object
Publisher              object
Image-URL-S            object
Image-URL-M            object
Image-URL-L            object
dtype: object

In [104]:
books.shape

(271360, 8)

In [105]:
books.isnull().sum()

ISBN                   0
Book-Title             0
Book-Author            1
Year-Of-Publication    0
Publisher              2
Image-URL-S            0
Image-URL-M            0
Image-URL-L            3
dtype: int64

In [106]:
# books['Book-Author'].mode().values
# statistics.mode(books['Book-Author'])

In [107]:
books['Book-Author'].replace(np.nan, statistics.mode(books['Book-Author']), inplace=True)

In [108]:
books['Publisher'].replace(np.nan, statistics.mode(books['Publisher']), inplace=True)

In [109]:
books['Image-URL-L'].fillna(method='bfill', inplace=True)

In [110]:
books.isnull().sum()

ISBN                   0
Book-Title             0
Book-Author            0
Year-Of-Publication    0
Publisher              0
Image-URL-S            0
Image-URL-M            0
Image-URL-L            0
dtype: int64

In [111]:
ratings.dtypes

User-ID         int64
ISBN           object
Book-Rating     int64
dtype: object

In [112]:
ratings.shape

(1149780, 3)

In [113]:
ratings.isnull().sum()

User-ID        0
ISBN           0
Book-Rating    0
dtype: int64

In [114]:
users.dtypes

User-ID       int64
Location     object
Age         float64
dtype: object

In [115]:
users.shape

(278858, 3)

In [116]:
users.isnull().sum()

User-ID          0
Location         0
Age         110762
dtype: int64

In [117]:
users.dropna(inplace=True)
# users['Age'].fillna(users['Age'].mean(axis=0))

In [118]:
users.shape

(168096, 3)

In [119]:
users.head()

    User-ID                        Location   Age
1         2       stockton, california, usa  18.0
3         4       porto, v.n.gaia, portugal  17.0
5         6   santa monica, california, usa  61.0
9        10      albacete, wisconsin, spain  26.0
10       11  melbourne, victoria, australia  14.0

## Fact-Finding

You may need to apply the `groupby` method here. Here's a great introduction: [Pandas GroupBy: Your Guide to Grouping Data in Python](https://realpython.com/pandas-groupby/).
### TODO: 
* Group the `ratings` dataframe by `User-ID` and check the `average` rating by user.
* Group the `ratings` dataframe by `ISBN` and check the `average` rating each book has gotten.
* Create a `Series` containing the number of books each user has read
* Who are the top 10 most rated authors?
* Who are the top 10 highest rated authors?

In [120]:
ratings.head()

   User-ID        ISBN  Book-Rating
0   276725  034545104X            0
1   276726  0155061224            5
2   276727  0446520802            0
3   276729  052165615X            3
4   276729  0521795028            6

In [121]:
user_rating = ratings.groupby('User-ID')['Book-Rating']
user_rating.mean().head()

User-ID
2     0.000000
7     0.000000
8     2.166667
9     2.000000
10    3.000000
Name: Book-Rating, dtype: float64

In [122]:
avg_rating_by_user = ratings.groupby('ISBN')['Book-Rating']
avg_rating_by_user.mean().head()

ISBN
 0330299891    3.0
 0375404120    1.5
 0586045007    0.0
 9022906116    3.5
 9032803328    0.0
Name: Book-Rating, dtype: float64

In [123]:
no_of_books_users_read = pd.Series(ratings.groupby(['User-ID'])['ISBN'].count(), name = 'Books per User')
no_of_books_users_read

User-ID
2          1
7          1
8         18
9          3
10         2
          ..
278846     2
278849     4
278851    23
278852     1
278854     8
Name: Books per User, Length: 105283, dtype: int64

In [124]:
rated_author = pd.Series(ratings.groupby(['ISBN'])['Book-Rating'].count(), name= 'Top 10 most Rated author')
rated_author.sort_values(ascending=False).head(10)

ISBN
0971880107    2502
0316666343    1295
0385504209     883
0060928336     732
0312195516     723
044023722X     647
0679781587     639
0142001740     615
067976402X     614
0671027360     586
Name: Top 10 most Rated author, dtype: int64

In [125]:
highest_rated = pd.Series(ratings.groupby(['ISBN'])['Book-Rating'].mean(), name= 'Top 10 highest Rated author')
highest_rated.sort_values(ascending=False).head(10)

ISBN
0874477050    10.0
561002010     10.0
0590939874    10.0
1570761914    10.0
56500624X     10.0
157076154X    10.0
1570761175    10.0
0373510365    10.0
0393092526    10.0
0590936026    10.0
Name: Top 10 highest Rated author, dtype: float64

## Engineering

### TODO: 
* Apply the `to_datetime` method to the `Year-of-Publication` `inplace`. 
* Use the `drop` method to drop all the `Image` columns in the `books` dataframe.
* Read this article - [How to Split String Column in Pandas into Multiple Columns](https://www.statology.org/pandas-split-column/) then apply the method to split the `location` column into three columns `city`, `state`, `country`.
* Which other `str` methods are available in pandas? Try out one or two others. 
* Merge the `ratings` and `books` dataframe into one dataframe named `books_and_ratings`
* Merge the `books_and_ratings` dataset and the `users` dataframe into a dataframe named `user_preferences`

In [126]:
books["Year-Of-Publication"] = pd.to_datetime(books["Year-Of-Publication"], format="%Y", errors = 'coerce')
books["Year-Of-Publication"].head()

0   2002-01-01
1   2001-01-01
2   1991-01-01
3   1999-01-01
4   1999-01-01
Name: Year-Of-Publication, dtype: datetime64[ns]

In [127]:
image_cols = ["Image-URL-S", "Image-URL-M", "Image-URL-L"]
books.drop(image_cols, axis = 1, inplace = True)

In [128]:
books.head()

,ISBN,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,0195153448,Classical Mythology,Mark P. O. Morford,2002-01-01,Oxford University Press
1,0002005018,Clara Callan,Richard Bruce Wright,2001-01-01,HarperFlamingo Canada
2,0060973129,Decision in Normandy,Carlo D'Este,1991-01-01,HarperPerennial
3,0374157065,Flu: The Story of the Great Influenza Pandemic...,Gina Bari Kolata,1999-01-01,Farrar Straus Giroux
4,0393045218,The Mummies of Urumchi,E. J. W. Barber,1999-01-01,W. W. Norton &amp; Company

In [129]:
users[['city', 'state', 'country']] = users['Location'].str.split(',', 2, expand=True)
users.drop(['Location'], axis = 1, inplace = True)
users.head()

    User-ID   Age          city        state     country
1         2  18.0      stockton   california         usa
3         4  17.0         porto     v.n.gaia    portugal
5         6  61.0  santa monica   california         usa
9        10  26.0      albacete    wisconsin       spain
10       11  14.0     melbourne     victoria   australia

In [130]:
# pd.Series('users'['city', 'state', 'country']).str.upper()

In [131]:
books_and_ratings = pd.merge(ratings,books, how="left", on='ISBN')
books_and_ratings.head()

,User-ID,ISBN,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Publisher
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002-01-01,Ballantine Books
1,276726,0155061224,5,Rites of Passage,Judith Rae,2001-01-01,Heinle
2,276727,0446520802,0,The Notebook,Nicholas Sparks,1996-01-01,Warner Books
3,276729,052165615X,3,Help!: Level 1,Philip Prowse,1999-01-01,Cambridge University Press
4,276729,0521795028,6,The Amsterdam Connection : Level 4 (Cambridge ...,Sue Leather,2001-01-01,Cambridge University Press

In [133]:
user_preferences = pd.merge(books_and_ratings,users, how="left", on='User-ID')
user_preferences.head()

,User-ID,ISBN,Book-Rating,Book-Title,Book-Author,Year-Of-Publication,Publisher,Age,city,state,country
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002-01-01,Ballantine Books,NaN,NaN,NaN,NaN
1,276726,0155061224,5,Rites of Passage,Judith Rae,2001-01-01,Heinle,NaN,NaN,NaN,NaN
2,276727,0446520802,0,The Notebook,Nicholas Sparks,1996-01-01,Warner Books,16.0,h,new south wales,australia
3,276729,052165615X,3,Help!: Level 1,Philip Prowse,1999-01-01,Cambridge University Press,16.0,rijeka,n/a,croatia
4,276729,0521795028,6,The Amsterdam Connection : Level 4 (Cambridge ...,Sue Leather,2001-01-01,Cambridge University Press,16.0,rijeka,n/a,croatia

## Querying and Indexing

Here's a useful article:
* [The Unreasonable Effectiveness of Method Chaining in Pandas](https://towardsdatascience.com/the-unreasonable-effectiveness-of-method-chaining-in-pandas-15c2109e3c69)

### TODO:
* Use the `query` method to return rows from the `user_preferences` dataframe where `User-ID` is equal to `276822`
* Repeat the same operation as before but this time return rows where `ISBN` is equal to `0345260317`
* Return rows where the `ISBN` is equal to `0345260317` and `Book-Rating` is greater than 0.
* Repeat all the operations performed above using the `loc` method rather than `query`
* Time the operation of both methods (See [Profiling and Timing Code](https://jakevdp.github.io/PythonDataScienceHandbook/01.07-timing-and-profiling.html)). Which is faster?
* Use the `to_dict` method to convert the output of query to dictionary. 
* Write a function that takes in a `dataframe` and a `user_id` and returns a dictionary of rows with matching user ids. Test your function using the `user_preferences` dataframe and any user id in the data.

In [134]:
user_preferences.columns =[column.replace("-", "_") for column in user_preferences.columns]
user_preferences.head()

,User_ID,ISBN,Book_Rating,Book_Title,Book_Author,Year_Of_Publication,Publisher,Age,city,state,country
0,276725,034545104X,0,Flesh Tones: A Novel,M. J. Rose,2002-01-01,Ballantine Books,NaN,NaN,NaN,NaN
1,276726,0155061224,5,Rites of Passage,Judith Rae,2001-01-01,Heinle,NaN,NaN,NaN,NaN
2,276727,0446520802,0,The Notebook,Nicholas Sparks,1996-01-01,Warner Books,16.0,h,new south wales,australia
3,276729,052165615X,3,Help!: Level 1,Philip Prowse,1999-01-01,Cambridge University Press,16.0,rijeka,n/a,croatia
4,276729,0521795028,6,The Amsterdam Connection : Level 4 (Cambridge ...,Sue Leather,2001-01-01,Cambridge University Press,16.0,rijeka,n/a,croatia

In [135]:
user_preference_1 = user_preferences.copy()
user_preference_2 = user_preferences.copy()
user_preference_3 = user_preferences.copy()

In [161]:
user_preference_1.query('User_ID == 276822', inplace = True)
user_preference_1.head()
%timeit user_preference_1

55.9 ns  1.42 ns per loop (mean  std. dev. of 7 runs, 10000000 loops each)

In [168]:
user_preference_1.to_dict('dict')

{'User_ID': {133: 276822,
  134: 276822,
  135: 276822,
  136: 276822,
  137: 276822,
  138: 276822,
  139: 276822,
  140: 276822,
  141: 276822,
  142: 276822,
  143: 276822,
  144: 276822,
  145: 276822,
  146: 276822,
  147: 276822,
  148: 276822},
 'ISBN': {133: '0060096195',
  134: '0141310340',
  135: '0142302198',
  136: '0156006065',
  137: '0375821813',
  138: '038076041X',
  139: '0439087597',
  140: '0439401399',
  141: '0552546933',
  142: '0689804458',
  143: '0699854289',
  144: '0786812508',
  145: '0786817070',
  146: '0805057706',
  147: '1551925060',
  148: '1573248533'},
 'Book_Rating': {133: 10,
  134: 9,
  135: 10,
  136: 9,
  137: 9,
  138: 10,
  139: 0,
  140: 6,
  141: 9,
  142: 8,
  143: 10,
  144: 9,
  145: 10,
  146: 10,
  147: 8,
  148: 10},
 'Book_Title': {133: 'The Boy Next Door',
  134: 'Skin and Other Stories (Now in Speak!)',
  135: 'Growing Wings',
  136: 'The Riddle of Scheherazade: And Other Amazing Puzzles',
  137: 'Hoot (Newbery Honor Book)',
  138: "A Kid's Guide to How to Save the Planet (Camelot world)",
  139: 'The Last Book in the Universe',
  140: 'The Contest',
  141: nan,
  142: 'A String in the Harp',
  143: nan,
  144: 'The Sandy Bottom Orchestra',
  145: 'Artemis Fowl (Artemis Fowl, Book 1)',
  146: 'The Number Devil: A Mathematical Adventure',
  147: 'Surviving Sam',
  148: 'Random Acts of Kindness'},
 'Book_Author': {133: 'Meggin Cabot',
  134: 'Roald Dahl',
  135: 'Laurel Winter',
  136: 'Raymond Smullyan',
  137: 'CARL HIAASEN',
  138: 'Billy Goodman',
  139: 'Rodman Philbrick',
  140: 'Gordon Korman',
  141: nan,
  142: 'Nancy Bond',
  143: nan,
  144: 'Jenny Nilson',
  145: 'Eoin Colfer',
  146: 'Hans Magnus Enzensberger',
  147: 'Karen Rivers',
  148: 'Dawna Markova'},
 'Year_Of_Publication': {133: Timestamp('2002-01-01 00:00:00'),
  134: Timestamp('2002-01-01 00:00:00'),
  135: Timestamp('2002-01-01 00:00:00'),
  136: Timestamp('1998-01-01 00:00:00'),
  137: Timestamp('2002-01-01 00:00:00'),
  138: Timestamp('1990-01-01 00:00:00'),
  139: Timestamp('2002-01-01 00:00:00'),
  140: Timestamp('2002-01-01 00:00:00'),
  141: NaT,
  142: Timestamp('1996-01-01 00:00:00'),
  143: NaT,
  144: Timestamp('1998-01-01 00:00:00'),
  145: Timestamp('2002-01-01 00:00:00'),
  146: Timestamp('1998-01-01 00:00:00'),
  147: Timestamp('2002-01-01 00:00:00'),
  148: Timestamp('2002-01-01 00:00:00')},
 'Publisher': {133: 'Avon Trade',
  134: 'Puffin Books',
  135: 'Puffin Books',
  136: 'Harvest Books',
  137: 'Knopf Books for Young Readers',
  138: 'Harpercollins Juvenile Books',
  139: 'Scholastic Signature',
  140: 'Scholastic',
  141: nan,
  142: 'Aladdin',
  143: nan,
  144: 'Hyperion Books for Children',
  145: 'Miramax Kids',
  146: 'Henry Holt &amp; Company',
  147: 'Polestar Book Publishers',
  148: 'Conari Press'},
 'Age': {133: 11.0,
  134: 11.0,
  135: 11.0,
  136: 11.0,
  137: 11.0,
  138: 11.0,
  139: 11.0,
  140: 11.0,
  141: 11.0,
  142: 11.0,
  143: 11.0,
  144: 11.0,
  145: 11.0,
  146: 11.0,
  147: 11.0,
  148: 11.0},
 'city': {133: 'calgary',
  134: 'calgary',
  135: 'calgary',
  136: 'calgary',
  137: 'calgary',
  138: 'calgary',
  139: 'calgary',
  140: 'calgary',
  141: 'calgary',
  142: 'calgary',
  143: 'calgary',
  144: 'calgary',
  145: 'calgary',
  146: 'calgary',
  147: 'calgary',
  148: 'calgary'},
 'state': {133: ' alberta',
  134: ' alberta',
  135: ' alberta',
  136: ' alberta',
  137: ' alberta',
  138: ' alberta',
  139: ' alberta',
  140: ' alberta',
  141: ' alberta',
  142: ' alberta',
  143: ' alberta',
  144: ' alberta',
  145: ' alberta',
  146: ' alberta',
  147: ' alberta',
  148: ' alberta'},
 'country': {133: ' canada',
  134: ' canada',
  135: ' canada',
  136: ' canada',
  137: ' canada',
  138: ' canada',
  139: ' canada',
  140: ' canada',
  141: ' canada',
  142: ' canada',
  143: ' canada',
  144: ' canada',
  145: ' canada',
  146: ' canada',
  147: ' canada',
  148: ' canada'}}

In [162]:
user_preference_2.query('ISBN == "0345260317"', inplace = True)
%timeit user_preference_2.head()

52.4 s  8.33 s per loop (mean  std. dev. of 7 runs, 10000 loops each)

In [169]:
user_preference_2.to_dict('dict')

{'User_ID': {9636: 67,
  143578: 32195,
  146270: 32773,
  274520: 64010,
  400554: 96440,
  430727: 102967,
  541943: 130474,
  628210: 152435,
  666954: 162155,
  764047: 184891,
  808014: 196160,
  839812: 203369,
  999961: 240144,
  1029081: 245988,
  1069333: 255489},
 'ISBN': {9636: '0345260317',
  143578: '0345260317',
  146270: '0345260317',
  274520: '0345260317',
  400554: '0345260317',
  430727: '0345260317',
  541943: '0345260317',
  628210: '0345260317',
  666954: '0345260317',
  764047: '0345260317',
  808014: '0345260317',
  839812: '0345260317',
  999961: '0345260317',
  1029081: '0345260317',
  1069333: '0345260317'},
 'Book_Rating': {9636: 0,
  143578: 0,
  146270: 0,
  274520: 7,
  400554: 0,
  430727: 0,
  541943: 0,
  628210: 7,
  666954: 0,
  764047: 0,
  808014: 0,
  839812: 0,
  999961: 0,
  1029081: 3,
  1069333: 0},
 'Book_Title': {9636: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  143578: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  146270: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  274520: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  400554: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  430727: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  541943: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  628210: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  666954: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  764047: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  808014: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  839812: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  999961: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  1029081: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  1069333: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence'},
 'Book_Author': {9636: 'Carl Sagan',
  143578: 'Carl Sagan',
  146270: 'Carl Sagan',
  274520: 'Carl Sagan',
  400554: 'Carl Sagan',
  430727: 'Carl Sagan',
  541943: 'Carl Sagan',
  628210: 'Carl Sagan',
  666954: 'Carl Sagan',
  764047: 'Carl Sagan',
  808014: 'Carl Sagan',
  839812: 'Carl Sagan',
  999961: 'Carl Sagan',
  1029081: 'Carl Sagan',
  1069333: 'Carl Sagan'},
 'Year_Of_Publication': {9636: Timestamp('1978-01-01 00:00:00'),
  143578: Timestamp('1978-01-01 00:00:00'),
  146270: Timestamp('1978-01-01 00:00:00'),
  274520: Timestamp('1978-01-01 00:00:00'),
  400554: Timestamp('1978-01-01 00:00:00'),
  430727: Timestamp('1978-01-01 00:00:00'),
  541943: Timestamp('1978-01-01 00:00:00'),
  628210: Timestamp('1978-01-01 00:00:00'),
  666954: Timestamp('1978-01-01 00:00:00'),
  764047: Timestamp('1978-01-01 00:00:00'),
  808014: Timestamp('1978-01-01 00:00:00'),
  839812: Timestamp('1978-01-01 00:00:00'),
  999961: Timestamp('1978-01-01 00:00:00'),
  1029081: Timestamp('1978-01-01 00:00:00'),
  1069333: Timestamp('1978-01-01 00:00:00')},
 'Publisher': {9636: 'Ballantine Books',
  143578: 'Ballantine Books',
  146270: 'Ballantine Books',
  274520: 'Ballantine Books',
  400554: 'Ballantine Books',
  430727: 'Ballantine Books',
  541943: 'Ballantine Books',
  628210: 'Ballantine Books',
  666954: 'Ballantine Books',
  764047: 'Ballantine Books',
  808014: 'Ballantine Books',
  839812: 'Ballantine Books',
  999961: 'Ballantine Books',
  1029081: 'Ballantine Books',
  1069333: 'Ballantine Books'},
 'Age': {9636: 43.0,
  143578: nan,
  146270: 28.0,
  274520: nan,
  400554: 29.0,
  430727: 54.0,
  541943: 33.0,
  628210: 40.0,
  666954: 57.0,
  764047: 50.0,
  808014: 22.0,
  839812: nan,
  999961: 34.0,
  1029081: nan,
  1069333: nan},
 'city': {9636: 'framingham',
  143578: nan,
  146270: 'olathe',
  274520: nan,
  400554: 'rochester',
  430727: 'olympia',
  541943: 'nashville',
  628210: 'indianapolis',
  666954: 'federal way',
  764047: 'yucaipa',
  808014: 'auburn',
  839812: nan,
  999961: 'muskego',
  1029081: nan,
  1069333: nan},
 'state': {9636: ' massachusetts',
  143578: nan,
  146270: ' kansas',
  274520: nan,
  400554: ' new york',
  430727: ' washington',
  541943: ' tennessee',
  628210: ' indiana',
  666954: ' washington',
  764047: ' california',
  808014: ' alabama',
  839812: nan,
  999961: ' wisconsin',
  1029081: nan,
  1069333: nan},
 'country': {9636: ' usa',
  143578: nan,
  146270: ' usa',
  274520: nan,
  400554: ' usa',
  430727: ' usa',
  541943: ' usa',
  628210: ' usa',
  666954: ' usa',
  764047: ' usa',
  808014: ' usa',
  839812: nan,
  999961: ' usa',
  1029081: nan,
  1069333: nan}}

In [163]:
user_preference_3.query('ISBN == "0345260317" and Book_Rating > 0', inplace = True)
%timeit user_preference_3

43.6 ns  1.17 ns per loop (mean  std. dev. of 7 runs, 10000000 loops each)

In [170]:
user_preference_3.to_dict('dict')

{'User_ID': {274520: 64010, 628210: 152435, 1029081: 245988},
 'ISBN': {274520: '0345260317', 628210: '0345260317', 1029081: '0345260317'},
 'Book_Rating': {274520: 7, 628210: 7, 1029081: 3},
 'Book_Title': {274520: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  628210: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence',
  1029081: 'The Dragons of Eden: Speculations on the Evolution of Human Intelligence'},
 'Book_Author': {274520: 'Carl Sagan',
  628210: 'Carl Sagan',
  1029081: 'Carl Sagan'},
 'Year_Of_Publication': {274520: Timestamp('1978-01-01 00:00:00'),
  628210: Timestamp('1978-01-01 00:00:00'),
  1029081: Timestamp('1978-01-01 00:00:00')},
 'Publisher': {274520: 'Ballantine Books',
  628210: 'Ballantine Books',
  1029081: 'Ballantine Books'},
 'Age': {274520: nan, 628210: 40.0, 1029081: nan},
 'city': {274520: nan, 628210: 'indianapolis', 1029081: nan},
 'state': {274520: nan, 628210: ' indiana', 1029081: nan},
 'country': {274520: nan, 628210: ' usa', 1029081: nan}}

In [164]:
user_preference = user_preferences.set_index('User_ID')
%timeit user_preference.loc[276822, :].head()

4.91 ms  780 s per loop (mean  std. dev. of 7 runs, 1 loop each)

In [165]:
user_preference = user_preferences.set_index('ISBN')
%timeit user_preference.loc['0345260317', :].head()

54.1 ms  2.12 ms per loop (mean  std. dev. of 7 runs, 1 loop each)

In [156]:
# user_preference = user_preferences.set_index('ISBN', 'Book_Rating > 0')
# user_preference.loc['0345260317', :].head()

The .loc runs faster

### Hierarchical Indexing

Study the [Hierarchical Indexing](https://jakevdp.github.io/PythonDataScienceHandbook/03.05-hierarchical-indexing.html) chapter from Python Data Science Handbook.

### TODO
* Include 3 or 4 of your observations in the `Comments` below after exploring the dataset

### Comments
* MultiIndex - We can create a multi-index from tuples.  MultiIndex contains multiple levels of indexing and multiple labeling
* reindex - and it can be reindexed
* Unstack() - 
* Stack()